app/views/musicians/index.html.erb

SELECT "musicians".* FROM "musicians"
---

    <% Musician.all.sort_by{ |x| x.name }.each do |musician| %>