app/views/bookings/index.html.erb

SELECT "bookings".* FROM "bookings" WHERE (booking_status != 'Active') ORDER BY created_at desc
SELECT "bookings".* FROM "bookings" ORDER BY created_at desc
---

  <% Booking.where("booking_status = 'Active'").order("created_at desc").each do |x| %>
    <%= link_to "Booking #{x.id} - #{x.created_at.to_date} - #{x.instruments.join('/')}", controller: "bookings", action: "show_status", id: x.id %> <br>