app/controllers/bookings_controller.rb

SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
---
  def show_status
    @booking = Booking.find(params[:id])

INSERT INTO "bookings" ("created_at", "updated_at", "instruments", "possible_times", "mp3_links", "video_links", "extra_links", "notes", "studio", "statuses", "booking_status") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    booking_params = params[:booking]
    instruments = booking_params[:instruments].select { |x| !x.blank? }
    statuses = {}
    statuses[:studio_reconfirmed] = "Incomplete"
    statuses[:studio_times] = {}
    statuses[:musicians] = {}
    statuses[:instruments] = {}
    instruments.each do |instrument|
      statuses[:instruments][instrument.to_sym] = "Incomplete"
      statuses[:musicians][instrument.to_sym] = {}
    end
    new_booking = Booking.new(
      instruments: instruments,
      possible_times: booking_params[:dates].split("\r\n"),
      mp3_links: booking_params[:mp3_links].split("\r\n"),
      video_links: booking_params[:video_links].split("\r\n"),
      extra_links: booking_params[:extra_links].split("\r\n"),
      notes: booking_params[:notes],
      studio: booking_params[:studio],
      statuses: statuses,
      booking_status: "Active"
    )
    new_booking.save!

SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
UPDATE "bookings" SET "updated_at" = ?, "booking_status" = ? WHERE "bookings"."id" = ?  [["updated_at", "2017-11-17 18:30:30.240555"], ["booking_status", "Failed - Messaged Dane (2017-11-17 13:30:30 -0500)"], ["id", 40]]
---
  def studio_reject
    booking = Booking.find(params[:id])
    reconfirm = params[:r].to_i == 0 ? false : true
    if reconfirm
      booking.statuses[:studio_reconfirmed] = "Rejected (#{Time.now})"
      booking.booking_status = "Failed - Messaged Dane (#{Time.now})"
      booking.save!

SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "bookings" SET "statuses" = ?, "booking_status" = ?, "updated_at" = ? WHERE "bookings"."id" = ?
---
  def studio_confirm
    booking = Booking.find(params[:id])
    reconfirm = params[:r].to_i == 0 ? false : true
    time = params[:t].to_i
    if reconfirm
      booking.statuses[:studio_reconfirmed] = "Confirmed (#{Time.now})"
      booking.booking_status = "Completed (#{Time.now})"
      booking.save!

SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
UPDATE "bookings" SET "updated_at" = ?, "booking_status" = ? WHERE "bookings"."id" = ?  [["updated_at", "2017-11-17 18:35:15.204446"], ["booking_status", "Failed - Messaged Dane (2017-11-17 13:35:15 -0500)"], ["id", 41]]
---
  def musician_reject
    booking = Booking.find(params[:id])
    instrument = INSTRUMENT_LIST.rassoc(params[:i].to_i)[0]
    musician = params[:n].to_i
    if !booking.statuses[:musicians][instrument.to_sym][musician].include?("Message Sent")
      @double_click = true
      return
    end
    booking.statuses[:musicians][instrument.to_sym][musician] = "Rejected (#{Time.now})"
    booking.save!

SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
UPDATE "bookings" SET "statuses" = ?, "updated_at" = ? WHERE "bookings"."id" = ?
---
  def musician_confirm
    booking = Booking.find(params[:id])
    instrument = INSTRUMENT_LIST.rassoc(params[:i].to_i)[0].to_sym
    musician = params[:n].to_i
    instrument_status = booking.statuses[:instruments][instrument]
    musician_status = booking.statuses[:musicians][instrument][musician]
    if !booking.statuses[:musicians][instrument.to_sym][musician].include?("Message Sent")
      @double_click = true
      return
    end
    if (instrument_status == "Confirmed") & (!musician_status.include?("Confirmed"))
      booking.statuses[:musicians][instrument.to_sym][musician] = "Late response (#{Time.now})"
      booking.save!