app/controllers/musicians_controller.rb

SELECT  "musicians".* FROM "musicians" WHERE "musicians"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def show
    if Musician.exists?(params[:id])
      @musician = Musician.find(params[:id])