app/controllers/sign_up_controller.rb

  def create
    musician_params = params[:musician]
    access_token = musician_params[:access_token]
    refresh_token = musician_params[:refresh_token]
    calendar_ids = musician_params[:calendar_ids].reject { |x| x.blank? }
    email = musician_params[:email]
    found_emails = Musician.where("email = '#{email}'").count
    if found_emails == 0 && !access_token.blank? && !refresh_token.blank? && !calendar_ids.blank?
      musician = Musician.new(
        name: musician_params[:name],
        email: email,
        phone_number: musician_params[:phone_number],
        primary_instrument: musician_params[:primary_instrument],
        access_token: access_token,
        refresh_token: refresh_token,
        calendar_ids: calendar_ids
      )
      musician.save!
---
SELECT COUNT(*) FROM "musicians" WHERE (email = '')
INSERT INTO "musicians" ("created_at", "updated_at", "name", "email", "primary_instrument", "access_token", "refresh_token", "phone_number", "calendar_ids") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)