app/controllers/songwriter_controller.rb

INSERT INTO "songwriters" ("created_at", "updated_at", "name", "email", "time_zone", "available_times", "ip_address", "city", "region", "country") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    return unless Songwriter.where("lower(email) like '#{params['email']}'").blank?
    songwriter = Songwriter.new
    songwriter.name = params['name']
    songwriter.email = params['email']
    songwriter.time_zone = params['time_zone']
    songwriter.available_times = params['available_times']
    songwriter.ip_address = params['ip_address']
    location = Geocoder.address(params['ip_address'])
    songwriter.city = location.split(',')[0] rescue nil
    songwriter.region = location.split(',')[1] rescue nil
    songwriter.country = location.split(',')[2] rescue nil
    songwriter.save!

SELECT DISTINCT "songwriters"."city" FROM "songwriters"
SELECT DISTINCT "songwriters"."region" FROM "songwriters"
SELECT COUNT(*) FROM "songwriters" WHERE (time_zone = '035	Eastern Standard Time	(GMT-05:00) Eastern Time (US and Canada)' AND lower(available_times) like '%Weekday Evenings%')
SELECT DISTINCT "songwriters"."country" FROM "songwriters"
SELECT DISTINCT "songwriters"."time_zone" FROM "songwriters"
---
  def index
    @cities = Songwriter.uniq.pluck(:city)
    @regions = Songwriter.uniq.pluck(:region)
    @countries = Songwriter.uniq.pluck(:country)
    @time_zones = Songwriter.uniq.pluck(:time_zone)